---
title: 脅威を検出するためのカスタム分析ルールを Azure Sentinel を使用して作成する | Microsoft Docs
description: このチュートリアルでは、セキュリティ上の脅威を検出するカスタム分析ルールを、Azure Sentinel を使用して作成する方法について説明します。 イベントのグループ化、アラートのグループ化、アラート エンリッチメントを利用し、自動無効化について理解します。
services: sentinel
documentationcenter: na
author: yelevin
manager: rkarlin
editor: ''
ms.service: azure-sentinel
ms.subservice: azure-sentinel
ms.devlang: na
ms.topic: conceptual
ms.tgt_pltfrm: na
ms.workload: na
ms.date: 02/10/2021
ms.author: yelevin
ms.openlocfilehash: 70b56e70ec0e6f511142c48cc89720c054807a5c
ms.sourcegitcommit: 32e0fedb80b5a5ed0d2336cea18c3ec3b5015ca1
ms.translationtype: HT
ms.contentlocale: ja-JP
ms.lasthandoff: 03/30/2021
ms.locfileid: "105042800"
---
# <a name="tutorial-create-custom-analytics-rules-to-detect-threats"></a>チュートリアル:脅威を検出するためのカスタム分析規則を作成する

Azure Sentinel に[データソースを接続](quickstart-onboard.md)した後は、環境に存在する脅威や異常な動作を検出するのに役立つカスタム分析ルールを作成できます。 これらのルールでは、環境全体で特定のイベントまたはイベントのセットを検索したり、特定のイベントのしきい値または条件に達したときにアラートを生成したり、SOC がトリアージと調査を行うためのインシデントを生成したり、自動化された追跡および修復プロセスによって脅威に対応したりします。 

このチュートリアルは、Azure Sentinel で脅威を検出するカスタム ルールを作成するために役立ちます。

このチュートリアルを読むと、次のことができるようになります。
> [!div class="checklist"]
> * 分析ルールを作成する
> * イベントとアラートの処理方法を定義する
> * アラートとインシデントの生成方法を定義する
> * ルールに対して脅威への自動対応を選択する

## <a name="create-a-custom-analytics-rule-with-a-scheduled-query"></a>スケジュールされたクエリを使用してカスタム分析ルールを作成する

1. Azure Sentinel のナビゲーション メニューから **[分析]** を選択します。

1. 上部のアクション バーで、 **[+ 作成]** を選択し、 **[スケジュール済みクエリ ルール]** を選択します。 **分析ルール ウィザード** が開きます。

    :::image type="content" source="media/tutorial-detect-threats-custom/create-scheduled-query-small.png" alt-text="スケジュール済みクエリを作成する" lightbox="media/tutorial-detect-threats-custom/create-scheduled-query-full.png":::

### <a name="analytics-rule-wizard---general-tab"></a>分析ルール ウィザード - [全般] タブ

- 一意の **[名前]** と **[説明]** を指定します。 

- **[方針]** フィールドでは、ルールを分類する攻撃のカテゴリを選択できます。 これらは、[MITRE ATT&CK](https://attack.mitre.org/) フレームワークの方針に基づいています。

- 必要に応じて、アラートの **[重大度]** を設定します。 

- ルールを作成すると、その **[状態]** は既定で **[有効]** になります。これは、作成が終わるとすぐに実行されることを意味します。 すぐに実行したくない場合は、 **[無効]** を選択します。ルールは **[アクティブな規則]** タブに追加され、必要に応じてそこから有効にすることができます。

   :::image type="content" source="media/tutorial-detect-threats-custom/general-tab.png" alt-text="カスタム分析ルールの作成を開始する":::

## <a name="define-the-rule-query-logic-and-configure-settings"></a>ルールのクエリ ロジックを定義して設定を構成する

**[ルールのロジックを設定]** タブでは、 **[ルールのクエリ]** フィールドにクエリを直接入力するか、または Log Analytics でクエリを作成し、コピーしてフィールドに貼り付けることができます。

- クエリは Kusto クエリ言語 (KQL) で作成します。 KQL の[概念](/azure/data-explorer/kusto/concepts/)と[クエリ](/azure/data-explorer/kusto/query/)の詳細については、この便利な[クイック リファレンス ガイド](/azure/data-explorer/kql-quick-reference)に関するページを参照してください。

- このスクリーンショットに示されている例では、*SecurityEvent* テーブルにクエリを実行して、[失敗した Windows ログオン イベント](/windows/security/threat-protection/auditing/event-4625)の種類を表示します。

   :::image type="content" source="media/tutorial-detect-threats-custom/set-rule-logic-tab-1-new.png" alt-text="クエリ ルールのロジックと設定を構成する" lightbox="media/tutorial-detect-threats-custom/set-rule-logic-tab-all-1-new.png":::

- もう 1 つ、異常な数のリソースが [Azure アクティビティ](../azure-monitor/essentials/activity-log.md)で作成されたときにアラートを発するサンプル クエリを次に示します。

    ```kusto
    AzureActivity
    | where OperationName == "Create or Update Virtual Machine" or OperationName =="Create Deployment"
    | where ActivityStatus == "Succeeded"
    | make-series dcount(ResourceId)  default=0 on EventSubmissionTimestamp in range(ago(7d), now(), 1d) by Caller
    ```

    > [!NOTE]
    > #### <a name="rule-query-best-practices"></a>ルールのクエリのベスト プラクティス
    > - クエリの長さは 1 から 10,000 文字にする必要があります。また、"`search *`" または "`union *`" を含めることはできません。
    >
    > - ADX 関数を使用して Log Analytics クエリウィンドウ 内で Azure Data Explorer クエリを作成することは、**サポートされていません**。
    >
    > - クエリで **`bag_unpack`** 関数を使用する場合、"`project field1`" を使用して列をフィールドとして射影しても、その列が存在しないと、クエリは失敗します。 このような事態を防ぐために、次のように列を射影する必要があります。
    >   - `project field1 = column_ifexists("field1","")`

### <a name="alert-enrichment"></a>アラート エンリッチメント

> [!IMPORTANT]
> アラート エンリッチメント機能は、現在 **プレビュー** 段階です。 ベータ版、プレビュー版、または一般提供としてまだリリースされていない Azure の機能に適用されるその他の法律条項については、「[Microsoft Azure プレビューの追加使用条件](https://azure.microsoft.com/support/legal/preview-supplemental-terms/)」を参照してください。
    
- クエリ結果のパラメーターを Azure Sentinel で認識されるエンティティにマップするには、 **[エンティティのマッピング]** 構成セクションを使用します。 エンティティにより、ルールの出力 (アラートとインシデント) が、その後の調査プロセスと修正アクションの構成要素として機能する重要な情報で強化されます。 また、 **[インシデントの設定]** タブでアラートをインシデントにグループ化するための条件でもあります。

    [Azure Sentinel のエンティティ](entities-in-azure-sentinel.md)について詳しく確認します。

    エンティティのマッピングの詳細な手順と、[下位互換性](map-data-fields-to-entities.md#notes-on-the-new-version)に関する重要な情報については、「[データ フィールドを Azure Sentinel のエンティティにマップする](map-data-fields-to-entities.md)」をご覧ください。

- **[カスタムの詳細]** 構成セクションを使用すると、クエリからイベント データ項目を抽出し、このルールによって生成されるアラートにそれらを表示できます。これにより、アラートとインシデントでイベント コンテンツをすぐに確認できます。

    アラートにカスタムの詳細を表示する詳細については、[詳細な手順](surface-custom-details-in-alerts.md)を参照してください。

### <a name="query-scheduling-and-alert-threshold"></a>クエリのスケジュール設定とアラートのしきい値

- **[クエリのスケジュール設定]** セクションで、次のパラメーターを設定します。

   :::image type="content" source="media/tutorial-detect-threats-custom/set-rule-logic-tab-2.png" alt-text="クエリのスケジュールとイベントのグループ化の設定" lightbox="media/tutorial-detect-threats-custom/set-rule-logic-tab-all-2-new.png":::

    - **[クエリの実行間隔]** の設定では、クエリが実行される頻度 (頻繁な 5 分間隔、または 14 日に 1 回程度の低い頻度) を制御します。

    - **[次の時間分の過去のデータを参照します]** の設定では、クエリの対象となるデータの期間を決定します。たとえば、過去 10 分間や過去 6 時間のデータのクエリを実行できます。 最大値は 14 日です。

        > [!NOTE]
        > **クエリ間隔とルックバック期間**
        >
        >  これら 2 つの設定は、ある程度まで互いに独立しています。 間隔より長い期間をカバーする短い間隔でクエリを実行できますが (重複するクエリがある場合)、カバレッジ期間を超える間隔でクエリを実行することはできません。そうしないと、クエリ カバレッジ全体にギャップが生じることになります。
        >
        > **インジェストの遅延**
        >
        > ソースでのイベントの生成と Azure Sentinel へのインジェストの間で発生する可能性がある **待機時間** を考慮し、データが重複せずに完全にカバーされるようにするために、Azure Sentinel では、スケジュールされた時間から **5 分間遅延** して、スケジュールされた分析ルールが実行されます。
        >
        > この遅延が必要になる理由とこの問題を解決する方法の技術的な詳細については、Ron Marsiano による [Azure Sentinel のスケジュールされたアラート ルールでのインジェストの遅延を処理する方法](https://techcommunity.microsoft.com/t5/azure-sentinel/handling-ingestion-delay-in-azure-sentinel-scheduled-alert-rules/ba-p/2052851)に関するすばらしいブログ投稿をご覧ください。

- ルールの感度を定義するには、 **[アラートのしきい値]** セクションを使用します。 たとえば、クエリが実行されるたびに 1,000 件を超える結果が返される場合にのみアラートを生成するルールが必要な場合は、 **[クエリ結果件数でアラートを生成する]** を **[次の値より大きい]** に設定し、数値の 1,000 を入力します。 これは必須フィールドなので、しきい値を設定しない場合、つまりアラートですべてのイベントを登録する場合は、数値のフィールドに「0」を入力します。
    
### <a name="results-simulation"></a>結果のシミュレーション

ウィザードの右側にある **[Results simulation]\(結果のシミュレーション\)** 領域で、 **[Test with current data]\(現在のデータでテストする\)** を選択すると、Azure Sentinel によって、現在定義されているスケジュールに従って、クエリから実行された最後の 50 回で生成された結果 (ログ イベント) のグラフが表示されます。 クエリを変更する場合は、 **[Test with current data]\(現在のデータでテストする\)** をもう一度クリックして、グラフを更新します。 グラフには、定義された期間における結果の数が表示されます。これは、 **[クエリのスケジュール設定]** セクションの設定によって決まります。
  
上のスクリーンショットのクエリに対する結果のシミュレーションは次のようになります。 左側は既定のビューであり、右側はグラフ上の特定の時点にマウス ポインターを合わせたときに表示される内容です。

:::image type="content" source="media/tutorial-detect-threats-custom/results-simulation.png" alt-text="結果のシミュレーションのスクリーンショット":::

クエリによってトリガーされるアラートが多すぎる場合や頻繁すぎる場合は、 **[クエリのスケジュール設定]** と **[アラートのしきい値]** [セクション](#query-scheduling-and-alert-threshold) の設定を試してから、 **[現在のデータでテストする]** をもう一度選択します。

### <a name="event-grouping-and-rule-suppression"></a>イベントのグループ化とルールの抑制

> [!IMPORTANT]
> 現在、イベントのグループ化は **プレビュー段階** にあります。 ベータ版、プレビュー版、または一般提供としてまだリリースされていない Azure の機能に適用されるその他の法律条項については、「[Microsoft Azure プレビューの追加使用条件](https://azure.microsoft.com/support/legal/preview-supplemental-terms/)」を参照してください。
    
- **[イベントのグループ化]** で、**イベント** の **アラート** へのグループ化を処理する 2 つの方法のうち、いずれかを選択します。 

    - **[すべてのイベントを単一のアラートにグループ化する]** (既定の設定)。 このルールでは、クエリで前記の **アラートのしきい値** よりも多くの結果が返される限り、実行されるたびに 1 つのアラートが生成されます。 このアラートには、結果で返されたすべてのイベントの概要が含まれています。 

    - **[各イベントに対するアラートをトリガーする]** 。 このルールでは、クエリによって返されるイベントごとに独自のアラートが生成されます。 これは、イベントを個々に表示する場合や、ユーザーやホスト名など、特定のパラメーター別にイベントをグループ化する場合に便利です。 これらのパラメーターはクエリ内で定義できます。
    
        現在のところ、1 つのルールで生成できるアラートの数は 20 に制限されています。 特定のルールで、 **[イベントのグループ化]** が **[各イベントに対するアラートをトリガーする]** に設定されていて、ルールのクエリから 20 を超えるイベントが返された場合、最初の 19 件のイベントについてはそれぞれに独自のアラートが生成され、20 番目のアラートでは、返された一連のイベント全体がまとめられます。 言い換えると、20 番目のアラートは、 **[すべてのイベントを単一のアラートにグループ化する]** オプションによって生成されたであろうアラートです。

    > [!NOTE]
    > **イベント** と **アラート** の違いは何でしょうか。
    >
    > - **イベント** は、アクションの 1 回の出現を表します。 たとえば、ログ ファイル内の 1 つのエントリは、1 つのイベントとしてカウントされる可能性があります。 このコンテキストでは、1 つのイベントは、分析ルールのクエリによって返された単一の結果を指します。
    >
    > - **アラート** は、一緒にまとめられるイベントのコレクションで、セキュリティの観点からは重要なものです。 イベントにセキュリティ上の重要な意味がある場合は、1 つのアラートに 1 つのイベントが含まれる場合があります。たとえば、勤務時間外に外国からの管理ログインがあったなどです。
    >
    > - では、**インシデント** とは何でしょうか。 Azure Sentinel の内部ロジックでは、**アラート** またはアラートのグループから **インシデント** が作成されます。 インシデント キューは、トリアージ、調査、修復といった SOC アナリストの作業の中心です。
    > 
    > Azure Sentinel は、いくつかのデータ ソースから未加工のイベントを取り込み、他のデータ ソースから処理済みのアラートを取り込みます。 ある時点で、どちらを扱っているかに注目することが重要です。

- アラートが生成された後、クエリ間隔を超える期間だけこのルールの操作を中断する場合は、 **[抑制]** セクションで、 **[アラートの生成後にクエリの実行を停止する]** の設定を **[オン]** にすることができます。 これをオンにする場合は、 **[クエリの実行を停止する]** をクエリの実行を停止する時間 (最大 24 時間) に設定する必要があります。

## <a name="configure-the-incident-creation-settings"></a>インシデントの作成の設定を構成する

**[Incident Settings]\(インシデントの設定\)** タブでは、アラートをアクションにつながるインシデントに変換するかどうか、およびその方法を選択できます。 このタブを設定しないと、すべてのアラートに対して個別に 1 つのインシデントが作成されます。 このタブの設定を変更することで、インシデントを作成しないようにしたり、複数のアラートを 1 つのインシデントにグループ化したりすることができます。

> [!IMPORTANT]
> インシデントの設定のタブは、現在、**プレビュー段階** にあります。 ベータ版、プレビュー版、または一般提供としてまだリリースされていない Azure の機能に適用されるその他の法律条項については、「[Microsoft Azure プレビューの追加使用条件](https://azure.microsoft.com/support/legal/preview-supplemental-terms/)」を参照してください。

:::image type="content" source="media/tutorial-detect-threats-custom/incident-settings-tab.png" alt-text="インシデントの作成とアラートのグループ化の設定を定義する":::

### <a name="incident-settings"></a>インシデントの設定

**[Incident Settings]\(インシデントの設定\)** セクションでは、 **[この分析ルールによってトリガーされるアラートからインシデントを作成する]** が既定で **[有効]** に設定されています。つまり、ルールによってトリガーされるすべての個々のアラートから、1 つの個別のインシデントが作成されます。
    
- このルールによってインシデントが作成されないようにする場合は (たとえば、このルールが後続の分析のために情報を収集するだけの場合)、これを **[無効]** に設定します。

- 単一のインシデントをアラートごとにではなく、アラートのグループから作成する場合は、次のセクションをご覧ください。

### <a name="alert-grouping"></a>アラートのグループ化

最大 150 件の類似したアラートまたは繰り返し発生するアラートのグループから単一のインシデントを生成する場合 (注を参照) は、 **[アラートのグループ化]** セクションで、 **[この分析ルールによってトリガーされる関連アラートをインシデントにグループ化する]** を **[有効]** に設定し、以下のパラメーターを設定します。

- **[選択した期間内に作成されたアラートのみにグループを制限する]** :似たアラートまたは繰り返し発生するアラートをグループ化する期間を決定します。 この期間内の対応するすべてのアラートでは、1 つのインシデントまたはインシデントのセットがまとめて生成されます (以下のグループ化の設定に依存します)。 この期間外のアラートでは、個別のインシデントまたはインシデントのセットが生成されます。

- **[この分析ルールによってトリガーされるアラートを次の方法で単一のインシデントにグループ化する]** :アラートをグループ化する基準を選択します。

    - **[すべてのエンティティが一致した場合にアラートを 1 つのインシデントにグループ化する]** :マップされている各エンティティ (上の [ルールのロジックを設定] タブで定義したもの) の値が同じ場合、アラートはグループ化されます。 これは推奨される設定です。

    - **[このルールによってトリガーされるすべてのアラートを 1 つのインシデントにグループ化する]** :値が同じではない場合でも、このルールによって生成されるすべてのアラートをグループ化します。

    - **[選択したエンティティが一致する場合にアラートを 1 つのインシデントにグループ化する]** :マップされたエンティティの一部 (ドロップダウン リストから選択可能) の値が同じ場合、アラートをグループ化します。 たとえば、ソースまたはターゲットの IP アドレスに基づいて個別のインシデントを作成する場合に、この設定を使用できます。

- **[Re-open closed matching incidents]\(クローズされた一致するインシデントを再度開く\)** :あるインシデントが解決されて閉じられたとします。後でそのインシデントに属するはずの別のアラートが生成されたときに、閉じられたインシデントを再び開きたい場合は、この設定を **[有効]** に設定します。別のアラートで新しいインシデントを作成する場合は **[無効]** のままにします。
    
    > [!NOTE]
    > **最大 150 件のアラート** を 1 つのインシデントにグループ化できます。 アラートを 1 つのインシデントにグループ化するルールによって生成されたアラートが 150 件を超える場合は、最初と同じインシデントの詳細を含む新しいインシデントが生成され、超過したアラートは新しいインシデントにグループ化されます。

## <a name="set-automated-responses-and-create-the-rule"></a>自動応答を設定してルールを作成する

1. **[Automated responses]\(対応の自動化\)** タブでは、カスタム ルールによってアラートが生成されたときに自動的に実行するプレイブックを選択します。 プレイブックの作成と自動化の詳細については、[脅威への対応](tutorial-respond-threats-playbook.md)に関する記事を参照してください。

    :::image type="content" source="media/tutorial-detect-threats-custom/automated-response-tab.png" alt-text="自動応答の設定を定義する":::

1. **[確認と作成]** を選択して新しいアラート ルールのすべての設定を確認します。 "検証に成功しました" というメッセージが表示されたら、 **[作成]** を選択してアラート ルールを初期化します。

    :::image type="content" source="media/tutorial-detect-threats-custom/review-and-create-tab.png" alt-text="すべての設定を確認してルールを作成する":::

## <a name="view-the-rule-and-its-output"></a>ルールとその出力を表示する
  
- 新しく作成されたカスタムルール (種類は "スケジュールされた") は、メインの **[分析]** 画面の **[アクティブなルール]** タブの下のテーブルにあります。 この一覧から、各ルールを有効にしたり、無効にしたり、削除したりできます。

- 作成したアラート ルールの結果を表示するには、 **[インシデント]** ページに移動します。ここでは、トリアージ、[インシデントの調査](tutorial-investigate-cases.md)、脅威の修復を行うことができます。

> [!NOTE]
> Azure Sentinel で生成されたアラートは、[Microsoft Graph Security](/graph/security-concept-overview) を通じて使用できます。 詳細については、[Microsoft Graph のセキュリティ アラートのドキュメント](/graph/api/resources/security-api-overview)を参照してください。

## <a name="troubleshooting"></a>トラブルシューティング

### <a name="issue-no-events-appear-in-query-results"></a>問題点:クエリ結果にイベントが表示されない

**[イベント グループ化]** が **[各イベントに対するアラートをトリガーする]** に設定されている場合、一部のシナリオでは、後でクエリ結果を表示するときに (インシデントからアラートに戻るときなど)、クエリ結果が表示されない可能性があります。 これは、イベントのアラートへの接続が、特定のイベントの情報のハッシュ化と、クエリにそのハッシュを含めることによって行われるためです。 アラートが生成された後にクエリ結果が変わった場合、ハッシュは無効になり、結果は表示されません。 

イベントを表示するには、ルールのクエリからハッシュを含む行を手動で削除し、クエリを実行します。

### <a name="issue-a-scheduled-rule-failed-to-execute-or-appears-with-auto-disabled-added-to-the-name"></a>問題点:スケジュールされたルールの実行に失敗するか、名前に「自動無効化」が追加される

スケジュールされたクエリ ルールの実行が失敗することはめったにありませんが、発生する可能性があります。 Azure Sentinel は、具体的な障害の種類とそれを引き起こした状況に基づいて、障害を一時的または永続的として事前に分類します。

#### <a name="transient-failure"></a>一時的な障害

一時的な障害は、一時的な状況が原因で発生し、すぐに正常な状況に戻ります。その時点で、ルールの実行は成功します。 Azure Sentinel によって一時的として分類される障害の例を次に示します。

- ルール クエリの実行に時間がかかりすぎて、タイムアウトになった。
- データ ソースと Log Analytics 間、または Log Analytics と Azure Sentinel 間の接続に問題がある。
- その他の新規および不明な障害は一時的なものと見なされます。

一時的な障害が発生した場合、Azure Sentinel では、(ある時点まで) 毎回増分するように事前定義された間隔で、ルールの実行が再試行し続けられます。 その後、ルールは次回のスケジュールされた時刻にのみ再び実行されます。 一時的な障害が原因で、ルールが自動的に無効になることはありません。

#### <a name="permanent-failure---rule-auto-disabled"></a>永続的な障害 - ルールの自動無効化

永続的な障害は、ルールの実行を許可する条件が変更されたことが原因で発生します。これは、ユーザーの介入なしでは元の状態に戻りません。 永続的として分類される障害の例をいくつか次に示します。

- (ルール クエリが運用されている) ターゲット ワークスペースが削除された。
- (ルール クエリが運用されている) ターゲット テーブルが削除された。
- Azure Sentinel がターゲット ワークスペースから削除された。
- ルール クエリで使用される関数が有効ではなくなった (変更または削除された)。
- ルール クエリのいずれかのデータ ソースに対するアクセス許可が変更された。
- ルール クエリのいずれかのデータ ソースが削除または切断された。

**同じルールに対して同じ種類の永続的な障害が事前に指定されている回数連続して発生した場合**、Azure Sentinel ではルールの実行が停止され、次の手順も実行されます。

- ルールを無効にします。
- ルールの名前の先頭に「**自動無効化**」という単語を追加します。
- 障害 (および無効化) の理由をルールの説明に追加します。

ルールの一覧を名前で並べ替えると、自動無効化されたルールがあるかどうかを簡単に確認することができます。 自動無効化されたルールは、一覧の先頭付近にあります。

SOC マネージャーは、自動無効化されたルールがあるかどうかについて、ルールの一覧を定期的に確認する必要があります。

## <a name="next-steps"></a>次のステップ

このチュートリアルでは、Azure Sentinel を使用して、脅威の検出を開始する方法について説明しました。

- [Azure Sentinel でインシデントを調査する](tutorial-investigate-cases.md)方法について確認します。
- [Azure Sentinel のエンティティ](entities-in-azure-sentinel.md)について確認します。
- [Azure Sentinel で脅威への自動対応を設定する](tutorial-respond-threats-playbook.md)方法について確認します。